Tekla Open API Reference for Tekla Structures 2025
LoftedPlate.BaseCurves Property
 The curves that define the directrix lines of the lofted plate. A lofted plate is defined by at least to base curves (non empty if they are Polycurve(s)).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<ICurve> BaseCurves { get; set; }
Public Property BaseCurves As List(Of ICurve)
	Get
	Set
Property Value
Type: List<ICurve>
Remarks
 Only the first two curves will be used for the plate. Additionally, if the base curves are polycurves, only the first geometry of each polycurve will be used.
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace